'בדיקת השערות - שונות אינה ידועה'
t=c(61.7,55.6,54.9,61.8,58.3,57.7,60.6,55.5,55.6,55.5,62.2,55.3,58.1,59.4,58.8)
'--------------------------------'
'p-val'
pv=pt((mean(t)-60)/(sqrt(var(t)/15)),14)
pv
'--------------------------------'
'עוצמה'
B <- 100000
n <- 15
mu0 <- 60
mu1 <- 58
sd = sqrt(4)
alpha = 0.08
reject <- 0
for (b in 1:B){
  Y.b <- rnorm(n,mu1,sd)
  T.b <- (mean(Y.b)-mu0)/(sd(Y.b)/sqrt(n))
'השוואה של הסטטיסטי לערך הקריטי - לבחור את המבחן הנכון'
'H1<H0'
  reject.b <- (T.b < -qt(1-alpha,n-1))
'H1>H0'
  'reject.b <- (T.b > qt(1-alpha,n-1))'
  reject = reject + reject.b
}
reject/B